import React from 'react';

function TMI() {
    return (
        <div>
            <p>
                어릴 적에 재믹스와 슈퍼 패미컴을 소유하고 있었다고 한다.
                닉네임의 유래는 원래 고전 유행어였던 우왕굳으로 하려 했으나 이미 선점 당해서 우왁굳으로 정한 것이라고 밝혔다. 우왁굳을 잘 모르는 사람들은 종종 우왕굳과 헷갈리는 듯하다.
                GTA 시리즈로 유명하지만 우왁굳이 처음으로 플레이 했던 게임은 '드래곤볼 어드밴스'였다.
                자신의 시청자 출신 방송인들에게 현실적인 조언을 한 적이 있다.
                처음 방송 켰을때 11명이 들어왔다고 한다.
                30대의 나이와 낮은 목소리 톤과 맞지 않게 귀여운 행동을 할 때가 많다. 평소의 무심한 이미지와 반대로 방송용 텐션이 올라갈 때마다 유치하고 천진난만한 모습을 보여준다. 이에 왁초딩,
                35살이 아니라 35개월 등의 드립이 나오기도 했다.
                한때 '왁심'이라는 우왁굳TV 잡지가 있었으며 방송국의 열혈 팬 회장이 직접 제작했다. 우왁굳TV 2기 초창기였던 2013년 12월부터 2014년 8월까지 발행되었는데 꽤 상당한 퀄리티를
                자랑했다.
                속칭 침팬치로 불리는 팬덤이 국내 인방계에서도 손꼽힐 만큼 폭넓은 규모를 자랑한다. 현재 유튜브와 트위치에서 활동중인 많은 방송인들이 우왁굳과의 시참 컨텐츠 혹은 우왁굳의 팬으로 방송에
                발을 들였고, 우왁굳 본인도 2016년 1월 방송에서 09 왁굳을 보던 중고딩들이 지금 자신을 먹여살리고 있다고 말할 정도로 고정 시청층이 많은 편이다.
                바부! 코리아의 부운영자였다. 2000년대 초반 인터넷에서 엽기 밈과 짤들이 유행했는데 바부 코리아는 그런 밈들을 유행시킨 커뮤니티 중 하나였다. 당시 우왁굳은 중학생이었으며 중학생
                부운영자로써 인지도도 높았다.
                2018년 3월 방송 중 시청자들에게 부모님 집 대출금을 자신이 오늘 다 갚았다며 어머니가 좋아하셨다며 시청자들에게 감사를 표했다.
                MBTI 검사를 여러 번 받았으며 매번 다른 결과가 나왔다고 한다. 내향 척도는 늘 변하지 않았다고.
                2019년 8월 2일 방송에서 약 50분 동안 엔젤에게 방송을 맡긴 적이 있다. 하지만 5000여명이었던 시청자 수가 7500여명까지 급상승 하고 평소보다 도네들도 연이어 들어오며 약
                3분간 도네가 밀리기도 하였다. 햄버거집에서 미슐랭 스타 음식점이 되었다고 여담으로 드립 레게노가 이때 탄생했다.
                자동차를 좋아하며 그 중에서도 BMW를 열렬히 좋아한다. BMW 코리아 25주년 기념으로 출시된 BMW M340i 페리도트 그린 에디션을 소유하고 있다고 밝혔다.
                호랑이vs사자에서 사자의 편을 들어주었다. 사자를 '우리자', 호랑이는 '느그랑이'라고 부르기도 했다.
                신문지를 백 번 접어서 영상을 찍으면 본인의 전 재산을 준다는 공약을 건 적이 있다. 물론 접을 때마다 배로 두꺼워지는 특성상 신문지는 10번 접는 것도 불가능하다.
                피곤할 때 잠들면 해괴한 신음을 내는 버릇이 있다. 그래서 엔젤의 왁트모르즈비 대리 방송 때 핀잔을 먹기도 했다.
                일본 유학 생활 시절에 매우 가난했다고 한다. 사용하던 노트북은 저사양 게임만 돌아갔으며 3층 2.8평 원룸에서 살았다고 한다. 심지어 창문을 열면 자동차가 지나 다니는 다리가 보였고보던
                TV도 남이 버린 브라운관 TV를 주운 것이라고 밝혔다.
                영상 마지막 추천 영상 칸에 따로 링크를 안 걸어놓는다. 알아서 찾아보라고 적어놓고 왁두의 "응~ 없어~"는 덤.
                2019년 12월 13일 방송에서 콜랩에서 탈퇴하였다고 밝혔다. 이후 함군이 설립한 패러블 엔터테인먼트에 들어갔다.
                얼굴 공개를 하지 않는다. 현실에서 다른 시청자들이 자신을 알아보는 게 사생활에 지장을 줄 것 같기 때문이라고. 그러나 어쩔 수 없이 얼굴을 본 시청자들이 몇몇 있다. 우왁굳 본인은
                사실상 얼공을 한 거나 다름없다고 한다. 출몰 지역타고 다니는 차종과 키우는 강아지, 배우자가 공개되었기 때문이라고.
                주변인들의 증언에 따르면 실제 외모가 배우 오창석과 느낌이 굉장히 비슷하다고 한다. 고창석이 아니다 또 다른 공통적인 외모 증언은 미남에 코가 매우 크며 피부가 흰 편이라고 한다.
                바나나는 어중간하게 뜬 아이돌 그룹에서 댄스를 담당하는 멤버 같은 외모라고 밝혔다. 천양은 우왁굳의 외모에 대해 '확실히 엔젤이 반할 만큼 잘생기셨으나 너무 말랐고 꾸미지 않는 게
                단점'이라고 밝혔다. 차로 예시를 들면 관리 안 된 페라리같은 외모라고. 노돌리는 생각보다 키가 크고 평균보다 마른 체격에 굉장한 코주부지만 외모는 보자마자 잘생겼다는 말이 나올 정도라고
                했다. 현재는 영상이 삭제되었으나 왁카데미 출신인 한코코는 마스코트인 왁두와 닮은 구석이라곤 없어보이지만 자세히 보면 은근 느낌이 나는 외모에, 딱 봤을 때 깔끔하고 멋있어서 마치 성공한
                30대 남성의 표본을 보는 느낌이었다고 밝혔다.
                엔젤의 말에 따르면 방송상 모습과 실제 모습이 별반 다를 게 없으며 엄살이 매우 심하다고 한다. 또한 상당히 꼼꼼하고 계획적인 성격이라고. 옷을 한번 사러 가면 가게마다 다 들려서 모든
                옷을 사이즈 별로 전부 입어보고 여행을 갈 때는 30분 간격으로 촘촘히 계획표를 짜온다고 한다. 우왁굳은 과장이라며 부정하였고 옷을 살 때 굉장히 까탈스러운 것과는 달리 몸 단장은
                싫어한다고 밝혔다.
                현재 우왁굳의 건강 상태는 그리 좋지 못하다.
                2020년 6월 30일 건강 악화를 이유로 주 5일 방송을 선언하였다.
                2020년 10월 갤럭시 Z 폴드2를 구매했다. 본인은 매우 만족한 듯.
                2021년 4월 22일 퀴즈 놀이를 하면서 본인이 좋아하는 것, 싫어하는 것 등의 인적 사항을 대부분 밝혔다. 가장 좋아하는 음식은 초밥, 가장 재밌게 본 영화는 커뮤터, 가장 좋아하는
                색깔은 초록색, 가장 좋아하는 계절은 봄, 가장 좋아하는 치킨 부위는 닭다리, 가장 즐겨보는 유튜브 분야는 인터뷰, 가장 좋아하는 초밥은 도미 초밥, 가장 싫어하는 음식은 번데기, 가장
                재미있게 본 애니는 이니셜 D, 가장 반려견이 이뻐 보일 때는 잘 때, 초등학교 때 장래희망은 과학자, 초등학교 때 좋아했던 과목은 미술, 선호하는 여행 스타일은 리조트, 가장 많이
                들어가는 어플은 유튜브, 새롭게 키워보고 싶은 동물은 고양이, 이름을 지어준 사람은 할아버지, 가장 만족하는 유행어는 알잘딱깔센이라고 밝혔다.
                동아일보에서 주관하는 정치성향 테스트를 한 적이 있다. 첫 번째 문항은 모두 응답했지만 사회적 이슈에 대한 의견을 묻는 두 번째 문항에서 답변을 주저하다 결국 테스트를 중단했다. 첫 번째
                문항의 우왁굳의 응답은 중도 보수에서 보수로 결과가 나온다.
                카톡에 아내인 엔젤의 이름을 '겅든님'으로 저장했다고 한다.
                아저씨라고 불리는 것을 굉장히 싫어한다. 본인의 IF 이상형 월드컵을 할 때 관련 선택지가 나오자 자신은 일반적인 스트리머들보다 나이가 많은 편이지만 아저씨는 아니라며 화를 냈다. 또한
                주르르와의 인터뷰 도중에 주르르가 우왁굳을 아저씨로 칭하자 자신은 아저씨가 아니라며 주르르의 말에 태클을 걸기도 했으며, VR챗 상황극 중에도 아저씨라고 언급당하면 바로 부정하는 모습을
                보여준다. 왁물원에 주르르가 우왁굳은 결혼했으니 아저씨가 맞다고 했다는 글이 올라오자, 만약 주르르가 20대 후반에 일찍 결혼하더라도 바로 아줌마로 만들어주겠다고 말하며 받아쳤다.
                우왁굳은 30대 중반의 성인 남성에 결혼까지 했으니 아저씨가 맞다.
                주량은 소주 1병이지만 맥주를 더 좋아한다.
                우왁굳의 팬카페 왁물원이 2022년 3월 30일 전체 네이버 카페 2등을 달성했다.
                비공식적으로 08년도 이전부터 라디오 방송을 했다고 한다.
                방송을 시청하는 사람이 많아져 도네가 밀리는 일이 자주 있다. 그래서 천원짜리 도네는 속도를 120%로 향상했다. 그래도 또 밀리면 속도를 10%씩 올리기로 했다. 하지만 그럼에도 자주
                도네가 밀린다.
                유교굳이라고 불릴 만큼 성적인 면에서 극보수주의적 성향. 이를테면 이세돌 멤버들의 의상도 노출이 심하지 않도록 설정했으며, 멤버들을 활용한 2차 창작 컨텐츠도 수위가 높거나 백합 관련물은
                철저히 금하고 있다.
                뱅갈고무나무를 키우고 있다.
                우왁굳이 만든 버츄얼 아이돌 이세돌의 곡 작사를 본인이 직접 하고 있다.
                2022년 3월 11일 방송에서 10,000,000원을 후원받았다. 우왁굳이 이제껏 받아본 후원 중 가장 큰 금액의 후원이라고 한다. 이전까지 받아본 큰 금액의 후원은 5,000,000원
                정도였는데 이번에 10,000,000원으로 갱신되었다. 이 10,000,000원 후원은 그냥 갖기에는 부담스러워서 이세계 아이돌 공식 앨범 3집 제작에 투자하겠다고 밝혔다.
            </p>
        </div>
    )
}

export default TMI;